/*2 Выведите столбец чисел от 89 до 11 - воспользуйтесь циклом while и отделите числа
тегом <br /> друг от друга, чтобы получить столбец, а не строку.
 */
// {
//   let i = 89;
// while (i >= 11) {
//   document.write(i + `<br>`);
//   i--;
// }

// }

/*4. Найдите сумму чисел в каждом числе от 1 до 5, например: в числе 3 сумма составляет 6
(1+2+3).
 */
// {
// let i = 1;
// let sum = 1;
// while (i <= 5) {
//   i++;
//   sum += i;
//   console.log(sum);
// }
// }

/*5. Выведите чётные числа от 8 до 56. Решить задание через while и for. */
// {
//   for (let i = 8; i <= 56; i+=2) {
//     console.log(i);
//   }
// }
// {
//   let i = 6;
//   while(i <= 56) {
//     i += 2;
//      console.log(i);
//   }
  
// }

/*6. Необходимо вывести на экран полную таблицу умножения (от 2 до 10) в виде:
2*2 = 4
2*3 = 6
2*4 = 8
2*5 = 10
…
3*1=3
3*2=6
3*3=9
3*4=12
…
Для решения задачи используйте вложенные циклы. */

{
  for (let i = 2; i <= 10; i++) {
    document.write(`this is i ${i}<br>`);
    for (let j = 1; j <= 10; j++) {
      document.write(`${i} * ${j} = ${i * j} <br>`);
    }
  }
}