// Напишите программу, которая генерирует случайным образом новый пароль, состоящий из 8 чисел (параметром можно задавать длину) и возвращает результат. По желанию, доработайте функцию: сделайте генератор паролей из латинских символов, целых чисел и специальных символов: _-,.&*^$#@+=!; минимум один большой символ, одна цифра, один спец. символ.

function getPassword(length) {
  let password = [];
  if (length === 8) {
    for (let i = 0; i < length; i++) {
      password.push(Math.round(Math.random() * (9 - 0) + 0));
    }
  }
    else {
      console.log('Неверная длина пароля');
    }
  

  return password.join('');
}
console.log(getPassword(8));
